In [33]:
import pandas as pd
import numpy as np

In [34]:
ser = pd.Series(['a', np.nan, 1, np.nan ,2])
#ser.notnull.sum()
print(ser)

0      a
1    NaN
2      1
3    NaN
4      2
dtype: object

## Data Frame

In [35]:
data = {
    "Name" : ["Alice_fernandes", "Bob_lama", "Charlie_chor", "David_becham", "Bob_lama"],
    "Age" : [24, 27, np.nan, 32,27],
    "Department" : ["HR", "Engineering", "Marketing", "Finance", "Engineering"],
    "salary" : [50000, 60000, 55000, np.nan, 60000]
}
print("\nData Dictionary:")
print(data)

Data Dictionary:
{'Name': ['Alice_fernandes', 'Bob_lama', 'Charlie_chor', 'David_becham', 'Bob_lama'], 'Age': [24, 27, nan, 32, 27], 'Department': ['HR', 'Engineering', 'Marketing', 'Finance', 'Engineering'], 'salary': [50000, 60000, 55000, nan, 60000]}

In [36]:
print("\nDataFrame from Dictionary:")
df = pd.DataFrame(data)
print(df)

DataFrame from Dictionary:
              Name   Age   Department   salary
0  Alice_fernandes  24.0           HR  50000.0
1         Bob_lama  27.0  Engineering  60000.0
2     Charlie_chor   NaN    Marketing  55000.0
3     David_becham  32.0      Finance      NaN
4         Bob_lama  27.0  Engineering  60000.0

In [37]:
df.head(2) # Display the first 2 rows of the DataFrame ,by default it shows 5 rows
df.tail(2) # Display the last 2 rows of the DataFrame ,by default it shows 5 rows

           Name   Age   Department   salary
3  David_becham  32.0      Finance      NaN
4      Bob_lama  27.0  Engineering  60000.0

## loc method in DataFrames:

In [39]:
df.loc[1:3, ["Name", "salary"]]  # Using labels to select rows and columns
# df.loc[0, ["Name", "Age"]]  # Using labels to select a single row and multiple columns

# df.iloc[:4, 0:2]  # Using integer positions to select rows and columns

# df.iloc[:, 0]  # Using integer positions to select all rows of the second column

# df['salary']  # Accessing a single column by its label
# df.drop('salary', axis=1)  # Deleting a column by its label

# print(df) # Original DataFrame remains unchanged unless inplace=True is specified
# #df.drop('salary', axis=1, inplace=True)  # Deleting a column by its label permanently ,by default inplace=False
# print("\nDataFrame after dropping 'salary' column:")    
print(df)

              Name   Age   Department   salary
0  Alice_fernandes  24.0           HR  50000.0
1         Bob_lama  27.0  Engineering  60000.0
2     Charlie_chor   NaN    Marketing  55000.0
3     David_becham  32.0      Finance      NaN
4         Bob_lama  27.0  Engineering  60000.0

In [ ]:
df.shape  # Get the dimensions of the DataFrame (rows, columns)

(5, 4)

In [ ]:
df.info()  # Get a concise summary of the DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         4 non-null      float64
 2   Department  5 non-null      object
 3   salary      4 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

In [ ]:
df.describe() # Summary statistics for numerical columns

             Age        salary
count   4.000000      4.000000
mean   27.500000  56250.000000
std     3.316625   4787.135539
min    24.000000  50000.000000
25%    26.250000  53750.000000
50%    27.000000  57500.000000
75%    28.250000  60000.000000
max    32.000000  60000.000000

## Broadcasting in Pandas:

In [ ]:
#df['salary']+5000  # Increase all salaries by 5000, creating a new Series 
df['salary'] = df['salary'] + 5000  # Update the 'salary' column in the DataFrame
print("\nDataFrame after increasing salaries by 5000:") 
print(df)

DataFrame after increasing salaries by 5000:
              Name   Age   Department   salary
0  Alice_fernandes  24.0           HR  55000.0
1         Bob_lama  27.0  Engineering  65000.0
2     Charlie_chor   NaN    Marketing  60000.0
3     David_becham  32.0      Finance      NaN
4         Bob_lama  27.0  Engineering  65000.0

## Renaming Columns:

In [ ]:
df.rename(columns = {'Department':'Dept'}, inplace=True)  # Renaming a column
print("\nDataFrame after renaming 'Department' to 'Dept':") 
print(df)

DataFrame after renaming 'Department' to 'Dept':
              Name   Age         Dept   salary
0  Alice_fernandes  24.0           HR  55000.0
1         Bob_lama  27.0  Engineering  65000.0
2     Charlie_chor   NaN    Marketing  60000.0
3     David_becham  32.0      Finance      NaN
4         Bob_lama  27.0  Engineering  65000.0

In [ ]:
df['salary'].unique()  # Get unique values in the 'salary' column

array([55000., 65000., 60000.,    nan])

In [ ]:
df['Dept'].value_counts()  # Count occurrences of each unique value in the 'dept' column

Dept
Engineering    2
HR             1
Marketing      1
Finance        1
Name: count, dtype: int64

## Adding/ Creating new column :

In [ ]:

df['promoted_salary'] = df['salary'] * 2  # Creating a new column with increased salary
print("\nDataFrame after adding 'promoted_salary' column:") 
print(df)

DataFrame after adding 'promoted_salary' column:
              Name   Age         Dept   salary  promoted_salary
0  Alice_fernandes  24.0           HR  55000.0         110000.0
1         Bob_lama  27.0  Engineering  65000.0         130000.0
2     Charlie_chor   NaN    Marketing  60000.0         120000.0
3     David_becham  32.0      Finance      NaN              NaN
4         Bob_lama  27.0  Engineering  65000.0         130000.0

# Data Celaning:

In [ ]:
## check for null values in the DataFrame
df.isnull()  # Check for null values in the DataFrame
df.isnull().sum()  # Count of null values in each column

Name               0
Age                1
Dept               0
salary             1
promoted_salary    1
dtype: int64

In [ ]:
## first way to drop rows with null values i.e if any null value is present in a row, that row will be dropped
tempdf = df.dropna(how='any')  # Drop rows with any null values, default is 'any' meaning if any null value is present in a row, that row will be dropped
print("\nDataFrame after dropping rows with null values:")  
print(tempdf) # Original DataFrame remains unchanged unless inplace=True is specified

DataFrame after dropping rows with null values:
              Name   Age         Dept   salary  promoted_salary
0  Alice_fernandes  24.0           HR  55000.0         110000.0
1         Bob_lama  27.0  Engineering  65000.0         130000.0
4         Bob_lama  27.0  Engineering  65000.0         130000.0

In [ ]:
df.dropna(how='all') # Drop rows where all values are null i.e if all values in a row are null, that row will be dropped else it will be retained

              Name   Age         Dept   salary  promoted_salary
0  Alice_fernandes  24.0           HR  55000.0         110000.0
1         Bob_lama  27.0  Engineering  65000.0         130000.0
2     Charlie_chor   NaN    Marketing  60000.0         120000.0
3     David_becham  32.0      Finance      NaN              NaN
4         Bob_lama  27.0  Engineering  65000.0         130000.0

In [ ]:
## second way of data cleaning is to fill the null values with some value
df.fillna(0000)  # Fill all null values with 0000 i.e replace null values with 0000 avoiding deletion of rows

df['Age'].fillna(df['Age'].mean())  # Fill null values in 'Age' column with the mean of that column, leaving other columns unchanged

df['salary'].fillna(df["salary"].median())  # Fill null values in 'salary' column with the median of that column, leaving other columns unchanged

0    55000.0
1    65000.0
2    60000.0
3    62500.0
4    65000.0
Name: salary, dtype: float64

### forward and backword fill in data cleaning

In [ ]:
df['Age'].fillna(method='ffill')  # Forward fill to propagate last valid observation forward to next valid  
df['Age'].fillna(method='bfill')  # Backward fill to propagate next valid observation backward to previous valid

C:\Users\sagar\AppData\Local\Temp\ipykernel_17628\2715718369.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Age'].fillna(method='ffill')  # Forward fill to propagate last valid observation forward to next valid
C:\Users\sagar\AppData\Local\Temp\ipykernel_17628\2715718369.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Age'].fillna(method='bfill')  # Backward fill to propagate next valid observation backward to previous valid

0    24.0
1    27.0
2    32.0
3    32.0
4    27.0
Name: Age, dtype: float64

### Replace a specific name in column

In [ ]:
df['Name'].replace('Alice_fernandes', 'shisir')  # Replace specific value in a column, here 'Alice' is replaced with 'shisir' in 'Name' column, it is not replaced in original DataFrame unless inplace=True is specified
df['Name'] = df['Name'].replace('Alice_fernandes', 'shisir')  # Replace specific value in a column permanently, here 'Alice' is replaced with 'shisir' in 'Name' column permanently because of assignment to the same column
print("\nDataFrame after replacing 'Alice_fernandes' with 'shisir' in 'Name' column:") 
print(df)

DataFrame after replacing 'Alice_fernandes' with 'shisir' in 'Name' column:
           Name   Age         Dept   salary  promoted_salary
0        shisir  24.0           HR  55000.0         110000.0
1      Bob_lama  27.0  Engineering  65000.0         130000.0
2  Charlie_chor   NaN    Marketing  60000.0         120000.0
3  David_becham  32.0      Finance      NaN              NaN
4      Bob_lama  27.0  Engineering  65000.0         130000.0

### Dealing with Duplicate data:

In [ ]:
df_dup = df[df.duplicated(keep = "first")]  # Check for duplicate rows in the DataFrame
df_dup

       Name   Age         Dept   salary  promoted_salary
4  Bob_lama  27.0  Engineering  65000.0         130000.0

In [ ]:
df.drop_duplicates()  # Drop duplicate rows from the DataFrame, keeping the first occurrence by default, it does not modify the original DataFrame unless inplace=True is specified

           Name   Age         Dept   salary  promoted_salary
0        shisir  24.0           HR  55000.0         110000.0
1      Bob_lama  27.0  Engineering  65000.0         130000.0
2  Charlie_chor   NaN    Marketing  60000.0         120000.0
3  David_becham  32.0      Finance      NaN              NaN

## Dealing with edge or invalid cases:

In [ ]:
# Lambda functions and apply method can also be used for data cleaning and transformation but not shown here
df['promoted_salary'] = df['promoted_salary'].apply(lambda x: x * 1.1 if x < 120000 else x) # Increase 'promoted_salary' by 10% using apply and lambda function
print("\nDataFrame after increasing 'promoted_salary' by 10% for values less than 120000:")
print(df)

DataFrame after increasing 'promoted_salary' by 10% for values less than 120000:
           Name   Age         Dept   salary  promoted_salary
0        shisir  24.0           HR  55000.0         121000.0
1      Bob_lama  27.0  Engineering  65000.0         130000.0
2  Charlie_chor   NaN    Marketing  60000.0         120000.0
3  David_becham  32.0      Finance      NaN              NaN
4      Bob_lama  27.0  Engineering  65000.0         130000.0

## spliting the first and last name:

In [ ]:
df['first', 'last'] = df['Name'].str.split('_')  # Split 'Name' column into 'first' and 'last' columns based on underscore delimiter
print("\nDataFrame after splitting 'Name' column into 'first' and 'last' columns:")
print(df)

DataFrame after splitting 'Name' column into 'first' and 'last' columns:
           Name   Age         Dept   salary  promoted_salary    (first, last)
0        shisir  24.0           HR  55000.0         121000.0         [shisir]
1      Bob_lama  27.0  Engineering  65000.0         130000.0      [Bob, lama]
2  Charlie_chor   NaN    Marketing  60000.0         120000.0  [Charlie, chor]
3  David_becham  32.0      Finance      NaN              NaN  [David, becham]
4      Bob_lama  27.0  Engineering  65000.0         130000.0      [Bob, lama]

## More on Lambda and Apply:

In [ ]:
def multiply_by_2(x):
    return x * 2    

df['Age'] = df['Age'].apply(multiply_by_2)  # Using apply method with a custom function to double the values in 'Age' column, here the original 'Age' column is updated with doubled values
print("\nDataFrame after doubling the values in 'Age' column:")
print(df)

DataFrame after doubling the values in 'Age' column:
           Name   Age         Dept   salary  promoted_salary    (first, last)
0        shisir  48.0           HR  55000.0         121000.0         [shisir]
1      Bob_lama  54.0  Engineering  65000.0         130000.0      [Bob, lama]
2  Charlie_chor   NaN    Marketing  60000.0         120000.0  [Charlie, chor]
3  David_becham  64.0      Finance      NaN              NaN  [David, becham]
4      Bob_lama  54.0  Engineering  65000.0         130000.0      [Bob, lama]

In [ ]:
df['Age'] = df['Age'].apply(lambda x: x/2 if x>40 else x)
df["Age"]

0    24.0
1    27.0
2     NaN
3    32.0
4    27.0
Name: Age, dtype: float64

## Joins and Merges

In [ ]:
department_info  = {
    "Dept": ["HR", "Engineering", "Marketing", "Finance"],
    "Manager": ["Alice", "Bob", "Charlie", "David"],
    "Location": ["New York", "San Francisco", "Chicago", "Boston"]
}
df2 = pd.DataFrame(department_info)
print("\nDepartment Info DataFrame:")
print(df2)

Department Info DataFrame:
          Dept  Manager       Location
0           HR    Alice       New York
1  Engineering      Bob  San Francisco
2    Marketing  Charlie        Chicago
3      Finance    David         Boston

In [ ]:
pd.concat([df, df2], axis=0)  # Concatenate two DataFrames side by side (columns)

,Name,Age,Dept,salary,promoted_salary,"(first, last)",Manager,Location
0,shisir,24.0,HR,55000.0,121000.0,[shisir],NaN,NaN
1,Bob_lama,27.0,Engineering,65000.0,130000.0,"[Bob, lama]",NaN,NaN
2,Charlie_chor,NaN,Marketing,60000.0,120000.0,"[Charlie, chor]",NaN,NaN
3,David_becham,32.0,Finance,NaN,NaN,"[David, becham]",NaN,NaN
4,Bob_lama,27.0,Engineering,65000.0,130000.0,"[Bob, lama]",NaN,NaN
0,NaN,NaN,HR,NaN,NaN,NaN,Alice,New York
1,NaN,NaN,Engineering,NaN,NaN,NaN,Bob,San Francisco
2,NaN,NaN,Marketing,NaN,NaN,NaN,Charlie,Chicago
3,NaN,NaN,Finance,NaN,NaN,NaN,David,Boston

In [ ]:
pd.merge(df,df2, on = "Dept")

,Name,Age,Dept,salary,promoted_salary,"(first, last)",Manager,Location
0,shisir,24.0,HR,55000.0,121000.0,[shisir],Alice,New York
1,Bob_lama,27.0,Engineering,65000.0,130000.0,"[Bob, lama]",Bob,San Francisco
2,Charlie_chor,NaN,Marketing,60000.0,120000.0,"[Charlie, chor]",Charlie,Chicago
3,David_becham,32.0,Finance,NaN,NaN,"[David, becham]",David,Boston
4,Bob_lama,27.0,Engineering,65000.0,130000.0,"[Bob, lama]",Bob,San Francisco